# Data Analysis and Manipulation on a **DATASET** using Pandas
---

Now that we have looked into some of the key functionalities of pandas, let's dive deeper and explore how to work on a Real Dataset with pandas.

##Importing dependencies

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings("ignore")

# **Reading the File**
---

Datasets come in variety of formats: TXT, CSV, EXCEL, JSON, etc.

pandas has various different functions for each file format.

Let's just discuss the CSV format today since it is one of the most commonly used format for standard datasets.

In [2]:
path = "Titanic.csv"
df = pd.read_csv(path)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### EXERCISE: Use `df` and print only the last 5 samples from the dataset

In [3]:
# write code in the line below
df[-5:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# **Data Analysis**
---

Here, we'll try to extract some important insights on the data like distributions of specific features or relationship between two or more features. This portion will be covered extensively during the Upcoming ML Talks Sessions.

### A brief overview of the data type and the null count of the dataset

df.info() provides a detailed log of the Number of non-null values present along with the Data Types of each Column.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Let's start analysing our data and try to gain some insights.

### Passenger Survival count

In [5]:
df[].value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

So, `549` passengers in total have died while `342` has survived.

### Distribution of passengers w.r.t various columns
---

We used `groupby()` and `pivot_table()` functions for this. These functions help a lot in exploring the underlying relationships between the features and the target column.

* `groupby()`: As the name suggests, it groups the input data by Series or columns as per our requirement.
* `pivot_table()`: It creates a spreadsheet-style pivot table just like a DataFrame. It can be used for the same purpose as `groupby()`.

In [ ]:
df.groupby(['Sex', 'Embarked'])['Name'].count()

This tells us about the people and their genders from respective Ports of Embarkation.

In [ ]:
df.pivot_table('Survived', index='Sex', columns='Pclass') #single level pivot table

This tells us about the people and their genders from respective passenger class that were able to survive.

In [ ]:
age = pd.cut(df['Age'], [0, 18, 80])
df.pivot_table('Survived', ['Sex', age], 'Pclass') #multi level pivot table

This tells us about the people, their gender and Age group(0-18 and 18-80) from respective passenger class that were able to survive.

# **Data Preprocessing**
---

Here, we'll manipulate / modify the data in order to make it suitable for feeding into the Machine Learning model. This portion covers the processes by pandas and further preprocessing techniques will be discussed during the Upcoming sessions.

## Resolving missing values

In [ ]:
# To view the actual amount of missing values in each column
df.isnull().sum()

It can be clearly seen that `Cabin`, `Age` and `Embarked` has missing values in them. 
* Since `Cabin` doesn't seem to be too important and has too many missing values, we'll drop the column.
* `Age` and `Embarked` seems to be important and doesn't have much missing values in comparison, so we'll drop the rows with null values.

In [ ]:
df.drop('Cabin', axis=1, inplace=True) #dropping the Cabin column
df1 = df.dropna(inplace=False)
df1

### EXERCISE: Instead of dropping the rows with missing values for `Age`, try filling them up using its `median`.

In [ ]:
# write code in the line below
df['Age'].fillna(value = df['Age'].median(), inplace=True)
df['Age'].isnull().value_counts()

## Extracting Required `features`

### Features

In [ ]:
features = df[['Age', 'Embarked', 'Fare', 'Parch', 'Pclass', 'Sex', 'SibSp']]
features

### Target Column: Survived

In [ ]:
#@title EXERCISE: Extract and print the Target column from `df` (mention in the chat box) 
target = df['Survived']
target

In [ ]:
target = df[['Survived']]
target

## Converting Categorical features to numerical

Machine Learning algorithms/models can't interpret an object/string data. So, we need to convert them into numerical ones.

In [ ]:
convert_dict = {
    'Embarked' : {'S' : 0,
                  'C' : 1,
                  'Q' : 2},
    'Sex' : {'female' : 0,
             'male' : 1}               
}

In [ ]:
features.replace(convert_dict, inplace=True) # replacing the categorical data with numerical data defined in the dict
features

Now, both the features and target column contain numerical data and this ends a basic example of Data analysis and manipulation using pandas. We can further save our final DataFrames into CSV files for future use.

In [ ]:
features.to_csv('Features.csv', index=False)
target.to_csv('Target.csv', index=False)